{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Diagnosis",
    "1": "General",
    "2": "Medication",
    "3": "Prevention",
    "4": "Symptoms",
    "5": "Treatment"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Diagnosis": 0,
    "General": 1,
    "Medication": 2,
    "Prevention": 3,
    "Symptoms": 4,
    "Treatment": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "vocab_size": 30522
}
